ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ancs.c
/******************************************************************************
* Function Name: Cy_BLE_ANCSS_SendNotification
***************************************************************************//**
*
*  Sends a notification of the specified characteristic value, as identified by
*  the charIndex.
*  On enabling notification successfully for a service characteristic it sends out a
*  Handle Value notification which results in a CY_BLE_EVT_ANCSC_NOTIFICATION event
*  at the GATT Client's end.
*
*  \param connHandle: The connection handle that consists of the device ID and ATT
*                     connection ID.
*  \param charIndex:  The index of the service characteristic.
*  \param attrSize:   The size of the characteristic value attribute.
*  \param attrValue:  The pointer to the characteristic value data that should
*                     be sent to the Client device.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request handled successfully
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*   * CY_BLE_ERROR_INVALID_OPERATION - Operation is invalid for this
*                                      characteristic
*   * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - An optional characteristic is absent
*   * CY_BLE_ERROR_INVALID_STATE - Connection with the Client is not established
*   * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*   * CY_BLE_ERROR_NTF_DISABLED - Notification is not enabled by the Client
*
* \events
*  None.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_ANCSS_SendNotification(cy_stc_ble_conn_handle_t connHandle,
                                                     cy_en_ble_ancs_char_index_t charIndex,
                                                     uint8_t attrSize,
                                                     uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult;

    /* Send notification if it is enabled and connected */
    if(Cy_BLE_GetConnectionState(connHandle) < CY_BLE_CONN_STATE_CONNECTED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if(charIndex >= CY_BLE_ANCS_CHAR_COUNT)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(cy_ble_ancsConfigPtr->ancss->charInfo[charIndex].descrHandle[CY_BLE_ANCS_CCCD] ==
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    else if(!CY_BLE_IS_NOTIFICATION_ENABLED(connHandle.attId, cy_ble_ancsConfigPtr->ancss->charInfo[charIndex].
                                             descrHandle[CY_BLE_ANCS_CCCD]))
    {
        apiResult = CY_BLE_ERROR_NTF_DISABLED;
    }
    else
    {
        cy_stc_ble_gatts_handle_value_ntf_t ntfParam =
        {
            /* Fill all the fields of the Write request structure ... */
            .handleValPair.attrHandle = cy_ble_ancsConfigPtr->ancss->charInfo[charIndex].charHandle,
            .handleValPair.value.val  = attrValue,
            .handleValPair.value.len  = attrSize,
            .connHandle               = connHandle
        };
        /* Send notification to the Client using a previously filled structure */
        apiResult = Cy_BLE_GATTS_Notification(&ntfParam);
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_ANCSS_WriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  cy_en_ble_gatt_err_code_t - A function result state if it succeeded
*  (CY_BLE_GATT_ERR_NONE) or failed with error codes:
*   * CY_BLE_GATTS_ERR_PROCEDURE_ALREADY_IN_PROGRESS;
*   * CY_BLE_GATTS_ERR_CCCD_IMPROPERLY_CONFIGURED.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_ANCSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;

    if(Cy_BLE_ANCS_ApplCallback != NULL)
    {
        cy_stc_ble_ancs_char_value_t locCharValue;
        locCharValue.charIndex = CY_BLE_ANCS_CHAR_COUNT;

        if(eventParam->handleValPair.attrHandle ==
           cy_ble_ancsConfigPtr->ancss->charInfo[CY_BLE_ANCS_NS].descrHandle[CY_BLE_ANCS_CCCD])
        {
            locCharValue.charIndex = CY_BLE_ANCS_NS;
        }
        else if(eventParam->handleValPair.attrHandle ==
                cy_ble_ancsConfigPtr->ancss->charInfo[CY_BLE_ANCS_DS].descrHandle[CY_BLE_ANCS_CCCD])
        {
            locCharValue.charIndex = CY_BLE_ANCS_DS;
        }
        else
        {
            /* Leave locCharValue.charIndex = CY_BLE_ANCS_CHAR_COUNT */
        }

        if(locCharValue.charIndex != CY_BLE_ANCS_CHAR_COUNT)
        {
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = eventParam->handleValPair,
                .connHandle      = eventParam->connHandle,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_PEER_INITIATED
            };
            gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

            locCharValue.connHandle = eventParam->connHandle;
            locCharValue.value = NULL;
            if(gattErr == CY_BLE_GATT_ERR_NONE)
            {
                uint32_t eventCode;

                if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                {
                    eventCode = (uint32_t)CY_BLE_EVT_ANCSS_NOTIFICATION_ENABLED;
                }
                else
                {
                    eventCode = (uint32_t)CY_BLE_EVT_ANCSS_NOTIFICATION_DISABLED;
                }

                Cy_BLE_ANCS_ApplCallback(eventCode, &locCharValue);
            }

