ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ancs.c
/******************************************************************************
* Function Name: Cy_BLE_ANCSC_GetCharRange
***************************************************************************//**
*
* Returns a possible range of the current characteristic descriptor via
* input parameter charRangeInfo->range
*
* \param *charRangeInfo: The pointer to a descriptor range information structure.
* \return
*  None.
*
******************************************************************************/
static void Cy_BLE_ANCSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(charRangeInfo->connHandle);
    uint32_t exitFlag = 0u;

    if(cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_ANCS)
    {
        if(charRangeInfo->srviIncIdx != CY_BLE_DISCOVERY_INIT)
        {
            cy_ble_discovery[discIdx].charCount++;
        }

        while((cy_ble_discovery[discIdx].charCount < (uint32_t)CY_BLE_ANCS_CHAR_COUNT) && (exitFlag == 0u))
        {
            uint32_t charIdx = cy_ble_discovery[discIdx].charCount;
            if((cy_ble_ancsc[discIdx].charInfo[charIdx].endHandle -
                cy_ble_ancsc[discIdx].charInfo[charIdx].valueHandle) != 0u)
            {
                /* Read characteristic range */
                charRangeInfo->range.startHandle = cy_ble_ancsc[discIdx].charInfo[charIdx].valueHandle + 1u;
                charRangeInfo->range.endHandle = cy_ble_ancsc[discIdx].charInfo[charIdx].endHandle;
                exitFlag = 1u;
            }
            else
            {
                cy_ble_discovery[discIdx].charCount++;
            }
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ANCSC_NotificationEventHandler
***************************************************************************//**
*
*  Handles a Notification event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  None.
*
******************************************************************************/
static void Cy_BLE_ANCSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ANCS_ApplCallback != NULL))
    {
        cy_stc_ble_ancs_char_value_t locCharValue;

        if(cy_ble_ancsc[discIdx].charInfo[CY_BLE_ANCS_NS].valueHandle == eventParam->handleValPair.attrHandle)
        {
            locCharValue.charIndex = CY_BLE_ANCS_NS;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else if(cy_ble_ancsc[discIdx].charInfo[CY_BLE_ANCS_DS].valueHandle == eventParam->handleValPair.attrHandle)
        {
            locCharValue.charIndex = CY_BLE_ANCS_DS;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
            /* Apple Notification Center Service doesn't support any other notification */
        }

        if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) == 0u)
        {
            locCharValue.connHandle = eventParam->connHandle;
            locCharValue.value = &eventParam->handleValPair.value;
            Cy_BLE_ANCS_ApplCallback((uint32_t)CY_BLE_EVT_ANCSC_NOTIFICATION, &locCharValue);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ANCSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles a Read Response event.
*
*  \param eventParam: The pointer to the data structure.
*
* \return
*  None.
*
******************************************************************************/
static void Cy_BLE_ANCSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ANCS_ApplCallback != NULL) &&
       (cy_ble_ancscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        cy_stc_ble_ancs_descr_value_t locDescrValue;

        if(cy_ble_ancsc[discIdx].charInfo[CY_BLE_ANCS_NS].descrHandle[CY_BLE_ANCS_CCCD] == cy_ble_ancscReqHandle[discIdx])
        {
            locDescrValue.charIndex = CY_BLE_ANCS_NS;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else if(cy_ble_ancsc[discIdx].charInfo[CY_BLE_ANCS_DS].descrHandle[CY_BLE_ANCS_CCCD] ==
                cy_ble_ancscReqHandle[discIdx])
        {
            locDescrValue.charIndex = CY_BLE_ANCS_DS;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
        }

        if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) == 0u)
        {
            locDescrValue.connHandle = eventParam->connHandle;
            locDescrValue.value = &eventParam->value;

            Cy_BLE_ANCS_ApplCallback((uint32_t)CY_BLE_EVT_ANCSC_READ_DESCR_RESPONSE, &locDescrValue);
        }

        cy_ble_ancscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ANCSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles a Write Response event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  None.
*
******************************************************************************/
static void Cy_BLE_ANCSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ANCS_ApplCallback != NULL) &&
       (CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE != cy_ble_ancscReqHandle[discIdx]))
    {
        if(cy_ble_ancsc[discIdx].charInfo[CY_BLE_ANCS_CP].valueHandle == cy_ble_ancscReqHandle[discIdx])
        {
            cy_stc_ble_ancs_char_value_t locCharIndex =
            {
                .connHandle = *eventParam,
                .charIndex  = CY_BLE_ANCS_CP,
                .value      = NULL
            };
            cy_ble_ancscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_ANCS_ApplCallback((uint32_t)CY_BLE_EVT_ANCSC_WRITE_CHAR_RESPONSE, &locCharIndex);
        }
        else
        {
            cy_stc_ble_ancs_descr_value_t locDescIndex;

            if(cy_ble_ancsc[discIdx].charInfo[CY_BLE_ANCS_NS].descrHandle[CY_BLE_ANCS_CCCD] ==
               cy_ble_ancscReqHandle[discIdx])
            {
                locDescIndex.charIndex = CY_BLE_ANCS_NS;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            }
            else if(cy_ble_ancsc[discIdx].charInfo[CY_BLE_ANCS_DS].descrHandle[CY_BLE_ANCS_CCCD] ==
                    cy_ble_ancscReqHandle[discIdx])
            {
                locDescIndex.charIndex = CY_BLE_ANCS_DS;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            }
            else
            {
                /* Apple Notification Center Service doesn't support any other notification */
            }

            if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) == 0u)
            {
                locDescIndex.connHandle = *eventParam;
                locDescIndex.descrIndex = CY_BLE_ANCS_CCCD;
                locDescIndex.value = NULL;

                cy_ble_ancscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_ANCS_ApplCallback((uint32_t)CY_BLE_EVT_ANCSC_WRITE_DESCR_RESPONSE, &locDescIndex);
            }
        }
    }
}


